### Exercise 1: From the given dataset print the first and last five rows

In [2]:
from pandas import *
from numpy import *

In [9]:
df = read_csv("Cars.csv")
df.set_index('index',inplace=True)
df

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...
81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

### Exercise 2: Clean the dataset and update the CSV file

**Hint:** Replace all column values which contain **`?`**, **`n.a`**, or **`NaN`**.

In [16]:
df['price'] = df['price'].fillna(0)
df

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...
81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

### Exercise 3: Find the most expensive car company name

Print most expensive car’s company name and price.

In [40]:
mx = df['price'].max()
df[df['price'] == mx]

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
34,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0

### Exercise 4: Print All Toyota Cars details

In [43]:
df[df['company']=='toyota']

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
47,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
48,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
49,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
50,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
51,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
52,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
53,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

### Exercise 5: Count total cars per company

In [25]:
car_count = df.groupby(['company']).agg(Cars_Count = ('body-style','count')).reset_index()
car_count

          company  Cars_Count
0     alfa-romero           3
1            audi           4
2             bmw           6
3       chevrolet           3
4           dodge           2
5           honda           3
6           isuzu           3
7          jaguar           3
8           mazda           5
9   mercedes-benz           4
10     mitsubishi           4
11         nissan           5
12        porsche           3
13         toyota           7
14     volkswagen           4
15          volvo           2

### Exercise 6: Find each company’s Higesht price car

In [28]:
df.groupby(['company'])[['body-style','price']].agg('max').reset_index()

          company body-style    price
0     alfa-romero  hatchback  16500.0
1            audi      wagon  18920.0
2             bmw      sedan  41315.0
3       chevrolet      sedan   6575.0
4           dodge  hatchback   6377.0
5           honda      wagon  12945.0
6           isuzu      sedan   6785.0
7          jaguar      sedan  36000.0
8           mazda      sedan  18344.0
9   mercedes-benz      wagon  45400.0
10     mitsubishi      sedan   8189.0
11         nissan      wagon  13499.0
12        porsche  hatchback  37028.0
13         toyota      wagon  15750.0
14     volkswagen      sedan   9995.0
15          volvo      wagon  13415.0

### Exercise 7: Find the average mileage of each car making company

In [34]:
df.groupby(['company'])['average-mileage'].agg(Average_Mileage = 'mean').reset_index()

          company  Average_Mileage
0     alfa-romero        20.333333
1            audi        20.000000
2             bmw        19.000000
3       chevrolet        41.000000
4           dodge        31.000000
5           honda        26.333333
6           isuzu        33.333333
7          jaguar        14.333333
8           mazda        28.000000
9   mercedes-benz        18.000000
10     mitsubishi        29.500000
11         nissan        31.400000
12        porsche        17.000000
13         toyota        28.714286
14     volkswagen        31.750000
15          volvo        23.000000

### Exercise 8: Sort all cars by Price column

In [41]:
df_price = df.sort_values(by=['price'],ascending=False).reset_index()
df_price

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
1,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
2,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
3,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
4,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
...,...,...,...,...,...,...,...,...,...,...
56,36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
57,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
58,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,0.0
59,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,0.0
60,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,0.0

### Exercise 9: Concatenate two data frames using the following conditions

**Hint:** Create two data frames using the following two dictionaries

In [52]:
import pandas as pd

GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
carsDf1 = pd.DataFrame.from_dict(GermanCars)

japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}
carsDf2 = pd.DataFrame.from_dict(japaneseCars)



carsDf = pd.concat([carsDf1,carsDf2])
carsDf

       Company   Price
0         Ford   23845
1     Mercedes  171995
2          BMV  135925
3         Audi   71400
0       Toyota   29995
1        Honda   23600
2       Nissan   61500
3  Mitsubishi    58900

### Exercise 10: Merge two data frames using the following condition

**Hint:** Create two data frames using the following two Dicts, Merge two data frames, and append the second data frame as a new column to the first data frame.

In [54]:
import pandas as pd

Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
carPriceDf = pd.DataFrame.from_dict(Car_Price)

car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}
carsHorsepowerDf = pd.DataFrame.from_dict(car_Horsepower)

carsDf = pd.merge(carPriceDf,carsHorsepowerDf,how = "inner")
carsDf

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160